<?php

return [
    /*
    |--------------------------------------------------------------------------
    | バリデーションメッセージ
    |--------------------------------------------------------------------------
    */
    'required' => ':attributeを入力してください', // ここで「〜を入力してください」と定義
    'email' => ':attributeを正しい形式で入力してください',
    'max' => [
        'string' => ':attributeは:max文字以内で入力してください',
    ],
    'min' => [
        'string' => ':attributeは:min文字以上で入力してください',
    ],
    'confirmed' => ':attributeが一致しません',
    'unique' => '登録済みの:attributeです',

    /*
    |--------------------------------------------------------------------------
    | 属性名の日本語化
    |--------------------------------------------------------------------------
    */
    'attributes' => [
        'name' => '名前',
        'email' => 'メールアドレス',
        'password' => 'パスワード',
    ],
];